
"qtMovieViewAccessibilityMovie" = "elokuva";
"qtMovieViewAccessibilityRole" = "rooli";
"qtMovieViewAccessibilitySubrole" = "sivurooli";
"qtMovieViewAccessibilityView" = "näkymä";
"qtMovieViewAccessibilityImage" = "kuva";

"qtMovieViewContextMenuFlashBack" = "Takaisin";
"qtMovieViewContextMenuFlashForward" = "Seuraava";
"qtMovieViewContextMenuFlashLoop" = "Silmukka";
"qtMovieViewContextMenuFlashPlay" = "Toista";
"qtMovieViewContextMenuFlashRewind" = "Kelaa takaisin";
"qtMovieViewContextMenuFlashShowAll" = "Näytä kaikki";
"qtMovieViewContextMenuFlashZoomIn" = "Lähennä";
"qtMovieViewContextMenuFlashZoomOut" = "Loitonna";

"qtMovieViewContextMenuLinearCopy" = "Kopioi";
"qtMovieViewContextMenuLinearCut" = "Leikkaa";
"qtMovieViewContextMenuLinearPaste" = "Sijoita";
"qtMovieViewContextMenuLinearPlay" = "Toista";
"qtMovieViewContextMenuLinearRedo" = "Tee sittenkin";
"qtMovieViewContextMenuLinearSelectAll" = "Valitse kaikki";
"qtMovieViewContextMenuLinearSelectNone" = "Poista aktivointi";
"qtMovieViewContextMenuLinearStop" = "Pysäytä";
"qtMovieViewContextMenuLinearUndo" = "Peru";

"qtMovieViewEditCut" = "Leikkaa";
"qtMovieViewEditCopy" = "Kopioi";
"qtMovieViewEditPaste" = "Sijoita";
"qtMovieViewEditDelete" = "Pyyhi";
"qtMovieViewEditAdd" = "Lisää";
"qtMovieViewEditAddScaled" = "Lisää skaalattuna";
"qtMovieViewEditReplace" = "Korvaa";
"qtMovieViewEditTrim" = "Rajaa";
"qtMovieViewEditDrop" = "Pudota";

"qtMovieFlattenOperation" = "Yhdistetään elokuvaa...";
"qtMovieInsertTrackSegmentOperation" = "Lisätään raitasegmenttiä...";
"qtMovieInsertMovieSegmentOperation" = "Lisätään elokuvasegmenttiä...";
"qtMoviePasteOperation" = "Sijoitetaan...";
"qtMovieAddMovieSelectionOperation" = "Lisätään elokuvavalintaa...";
"qtMovieCopyOperation" = "Kopioidaan...";
"qtMovieCutOperation" = "Leikataan...";
"qtMovieLoadMovieIntoRamOperation" = "Ladataan elokuvaa muistiin...";
"qtMovieLoadTrackIntoRamOperation" = "Ladataan raitaa muistiin...";
"qtMovieLoadMediaIntoRamOperation" = "Ladataan mediaa muistiin...";
"qtMovieImportOperation" = "Tuodaan elokuvaa...";
"qtMovieExportOperation" = "Viedään elokuvaa...";
"qtMovieUnknownOperation" = "Suoritetaan tuntematonta operaatiota...";

"qtMovieViewClippingName" = "Elokuvaleike ";

"QTMoviePosterTimeAttribute" = "Aseta näytekuvan aika";
"QTTrackHighQualityVideoAttribute" = "Aseta korkealaatuinen video";
"QTTrackDeinterlaceVideoAttribute" = "Aseta lomituksenpoisto";
"QTTrackSingleFieldVideoAttribute" = "Aseta yksikenttäinen video";
"QTTrackPreloadTrackAttribute" = "Aseta raidan esilataus";
"QTTrackNeverPurgeTrackAttribute" = "Aseta ei poistettava raita";
"QTTrackMatrixAttribute" = "Aseta raidan matriisi";
"QTTrackChapterlistAttribute" = "Aseta kappaleluettelo";
"QTTrackMaskAttribute" = "Aseta raidan maski";
"QTTrackVolumeAttribute" = "Aseta raidan äänenvoimakkuus";
"QTTrackBalanceAttribute" = "Aseta raidan tasapaino";
"QTTrackHrefAttribute" = "Aseta raidan HREF";
"QTTrackTransferModeAttribute" = "Aseta videon siirtotila";
"QTTrackOperationColorAttribute" = "Aseta videotoiminnon väri";
"QTTrackEnabledAttribute" = "Aseta raita käyttöön";
"QTTrackLanguageAttribute" = "Aseta raidan kieli";
"QTTrackLayerAttribute" = "Aseta raidan taso";
"QTTrackDisplayNameAttribute" = "Aseta raidan nimi";

"QTTrackDefaultName" = "Raita";
"QTTextTrackDefaultName" = "Tekstiraita";
"QTChapterTrackDefaultName" = "Kappaleraita";
"QTVideoTrackDefaultName" = "Videoraita";
"QTSoundTrackDefaultName" = "Ääniraita";
"QTSubtitleTrackDefaultName" = "Tekstitysraita";
"QTClosedCaptionTrackDefaultName" = "Kuulovammaistekstitysraita";

"QTFormatDescriptionVideoFormatSummary" = "%@, %.0f x %.0f";
"QTFormatDescriptionVideoWithCleanApertureFormatSummary" = "%@, %.0f x %.0f (%.0f x %.0f)";

"QTFormatDescriptionProtectedAACFormat" = "AAC (suojattu)";
"QTFormatDescriptionProtectedAC3Format" = "AC3 (suojattu)";
"QTFormatDescriptionGenericVideoMediaFormatSummary" = "Videomedia";
"QTFormatDescriptionGenericAudioMediaFormatSummary" = "Äänimedia";
"QTFormatDescriptionGenericMuxedMediaFormatSummary" = "Multipleksoitu media";
"QTFormatDescriptionGenericTextMediaFormatSummary" = "Tekstimedia";
"QTFormatDescriptionGenericUnknownMediaFormatSummary" = "Tuntematon media";

"QTFormatDescriptionMPEG1SystemMuxedMediaFormatSummary" = "MPEG-1-järjestelmävirta";
"QTFormatDescriptionMPEG2TransportMuxedMediaFormatSummary" = "MPEG-2-siirtovirta";
"QTFormatDescriptionMPEG2ProgramMuxedMediaFormatSummary" = "MPEG-2-ohjelmavirta";
"QTFormatDescriptionDVMuxedMediaFormatSummary" = "DV multipleksattu virta";

"QTCaptureDeviceUnknownDevice" = "Tuntematon laite";

/* QTCompressionOptions localized names */
"QTCompressionOptionsLosslessAppleIntermediateVideo_displayName" = "Apple Intermediate";
"QTCompressionOptionsLosslessAnimationVideo_displayName" = "Animaatio paras laatu";
"QTCompressionOptionsJPEGVideo_displayName" = "JPEG korkea laatu";
"QTCompressionOptions120SizeH264Video_displayName" = "H.264 160x120";
"QTCompressionOptions240SizeH264Video_displayName" = "H.264 320x240";
"QTCompressionOptionsSD480SizeH264Video_displayName" = "H.264 SD";
"QTCompressionOptionsHD720SizeH264Video_displayName" = "H.264 HD 720";
"QTCompressionOptionsHD1080SizeH264Video_displayName" = "H.264 HD 1080";
"QTCompressionOptionsPrivateH264Video_displayName" = "H.264 korkea laatu";
"QTCompressionOptions120SizeMPEG4Video_displayName" = "MPEG-4 160x120";
"QTCompressionOptions240SizeMPEG4Video_displayName" = "MPEG-4 320x240";
"QTCompressionOptionsSD480SizeMPEG4Video_displayName" = "MPEG-4 SD";
"QTCompressionOptionsHD720SizeMPEG4Video_displayName" = "MPEG-4 HD 720";
"QTCompressionOptionsHD1080SizeMPEG4Video_displayName" = "MPEG-4 HD 1080";
"QTCompressionOptionsLosslessALACAudio_displayName" = "Apple Lossless";
"QTCompressionOptionsHighQualityAACAudio_displayName" = "AAC korkea laatu";
"QTCompressionOptionsVoiceQualityAACAudio_displayName" = "AAC puhelaatu";

"QTCompressionOptionsLosslessALACAudio_compressionOptionsSummary" = "Muoto: Apple Lossless";
"QTCompressionOptionsHighQualityAACAudio_compressionOptionsSummary" = "Muoto: AAC\nBittinopeus: 128 kb/s kanavaa kohden";
"QTCompressionOptionsVoiceQualityAACAudio_compressionOptionsSummary" = "Muoto: AAC\nBittinopeus: 32 kb/s kanavaa kohden\nNäytetaajuus: 22,050 kHz";

"QTCompressionOptionsCompressorSummary" = "Pakkaus: %@";
"QTCompressionOptionsSizeSummary" = "Enimmäiskoko: %d x %d";

"qtKitError" = "Virhe";
/*these strings are taken directly from ErrorResources.h*/
"qtKitErrorString34" = "Levy on täynnä.";
"qtKitErrorString35" = "Taltiota ei löytynyt.";
"qtKitErrorString36" = "Tapahtui I/O-virhe.";
"qtKitErrorString37" = "Havaittiin virheellinen tiedoston tai taltion nimi.";
"qtKitErrorString38" = "Tiedosto ei ole avoinna.";
"qtKitErrorString39" = "Kohdattiin tiedoston loppu.";
"qtKitErrorString41" = "Muisti on täynnä.";
"qtKitErrorString42" = "Liian monta tiedostoa on auki.";
"qtKitErrorString43" = "Tiedostoa tai hakemistoa ei löytynyt.";
"qtKitErrorString44" = "Taltio on lukittu.";
"qtKitErrorString45" = "Tiedosto on lukittu.";
"qtKitErrorString46" = "Taltio on lukittu.";
"qtKitErrorString47" = "Tiedosto on varattu.";
"qtKitErrorString48" = "Samanniminen tiedosto on jo olemassa.";
"qtKitErrorString192" = "Vaadittua resurssia ei löytynyt.";
"qtKitErrorString193" = "Vaadittua resurssitiedostoa ei löytynyt.";
"qtKitErrorString194" = "Resurssin lisääminen tiedostoon epäonnistui.";
"qtKitErrorString195" = "Resurssiviitteen lisääminen tiedostoon epäonnistui.";
"qtKitErrorString196" = "Resurssin poistaminen epäonnistui.";
"qtKitErrorString197" = "Resurssiviitteen poistaminen epäonnistui.";
"qtKitErrorString198" = "Havaittiin resurssi, jolla on yhteensopimaton attribuutti.";
"qtKitErrorString199" = "Resurssitaulukko on virheellinen.";
"qtKitErrorString1409" = "Määriteltyä tiedostohaaraa ei ole olemassa.";
"qtKitErrorString2000" = "Tarvittavaa viitettä ei voitu ratkaista.";
"qtKitErrorString2001" = "Elokuvasta löydettiin virheellinen kuvakuvaus.";
"qtKitErrorString2002" = "Elokuvasta löydettiin virheellinen julkinen elokuvakomponentti.";
"qtKitErrorString2003" = "Elokuvan tarvitsemaa datakäsittelijää ei löytynyt.";
"qtKitErrorString2004" = "Elokuvan tarvitsemaa datakäsittelijää ei voitu avata.";
"qtKitErrorString2005" = "Elokuvasta löydettiin virheellinen komponenttityyppi.";
"qtKitErrorString2006" = "Elokuvan tarvitsemaa mediakäsittelijää ei löytynyt.";
"qtKitErrorString2007" = "Elokuvan tarvitsemaa datakäsittelijää ei löytynyt.";
"qtKitErrorString2008" = "Elokuvasta löydettiin virheellistä mediatietoa.";
"qtKitErrorString2009" = "Elokuvasta löydettiin virheellinen raita.";
"qtKitErrorString2010" = "Elokuva sisältää virheellistä dataa.";
"qtKitErrorString2011" = "Elokuva sisältää virheellisen näytetaulun.";
"qtKitErrorString2012" = "Elokuva sisältää virheellisen viitetiedon.";
"qtKitErrorString2013" = "Elokuva sisältää virheellisen datakäsittelijän.";
"qtKitErrorString2014" = "Elokuvan kesto on virheellinen.";
"qtKitErrorString2015" = "Elokuva sisältää virheellisen aika-arvon.";
"qtKitErrorString2016" = "Julkista elokuvakomponenttia ei voitu tallentaa elokuvaan.";
"qtKitErrorString2017" = "Elokuvassa on virheellinen muokkausluettelo.";
"qtKitErrorString2018" = "Elokuvan mediatyypit eivät täsmää.";
"qtKitErrorString2019" = "Toiminto kumottiin.";
"qtKitErrorString2020" = "Movies Toolboxia ei ole alustettu.";
"qtKitErrorString2021" = "Tarvittavaa työskentelytiedostoa ei löytynyt.";
"qtKitErrorString2022" = "Tiedostoa, jossa on vain dataosa, ei voitu luoda.";
"qtKitErrorString2023" = "Muokkaustila oli virheellinen.";
"qtKitErrorString2024" = "Muokkaustilalle ei ollut vastaavuutta.";
"qtKitErrorString2025" = "Muokkaustila on tuntematon.";
"qtKitErrorString2026" = "Osa elokuvan käyttäjätiedoista puuttuu.";
"qtKitErrorString2027" = "Ohjelmassa havaittiin virhe.";
"qtKitErrorString2028" = "Syötettiin virheellinen raitahakemisto.";
"qtKitErrorString2029" = "Raidan tunnistenumeroa ei löydetty.";
"qtKitErrorString2030" = "Kyseinen raita ei ole elokuvassa.";
"qtKitErrorString2031" = "Kyseinen aika ei ole annetussa raidassa.";
"qtKitErrorString2032" = "Kyseinen aika ei ole annetussa mediassa.";
"qtKitErrorString2033" = "Syötettiin virheellinen muokkausindeksi.";
"qtKitErrorString2034" = "Havaittiin odottamaton virhe QuickTimessa.";
"qtKitErrorString2035" = "Tarvittavaa raitaa ei voitu ottaa käyttöön.";
"qtKitErrorString2036" = "Elokuvasta löydettiin virheellinen suorakaide.";
"qtKitErrorString2037" = "Elokuvasta löydettiin virheellinen näytenumero.";
"qtKitErrorString2038" = "Elokuvasta löydettiin virheellinen lohkonumero.";
"qtKitErrorString2039" = "Elokuvasta löydettiin virheellinen näytekuvauksen indeksi.";
"qtKitErrorString2040" = "Elokuvasta löydettiin virheellinen lohkovälimuisti.";
"qtKitErrorString2041" = "Elokuvasta löydettiin virheellinen näytekuvaus.";
"qtKitErrorString2042" = "Tiedoston dataosa ei ollut auki lukutilassa.";
"qtKitErrorString2043" = "Tiedoston dataosa ei ollut auki kirjoitustilassa.";
"qtKitErrorString2044" = "Tiedoston dataosa oli jo avattu kirjoitustilaan.";
"qtKitErrorString2045" = "Tiedoston dataosa oli jo suljettu.";
"qtKitErrorString2046" = "Kohdattiin elokuvan loppu.";
"qtKitErrorString2047" = "Havaittiin virheellinen dataviite.";
"qtKitErrorString2048" = "Tiedosto ei ole elokuvatiedosto.";
"qtKitErrorString2049" = "Elokuvasta löytyi virheellinen viitekehys.";
"qtKitErrorString2050" = "Elokuvasta löytyi virheellinen viitehakemisto.";
"qtKitErrorString2051" = "Elokuvalla ei ole datatiedostoja levyllä. Tallenna elokuva ja yritä uudelleen.";
"qtKitErrorString2052" = "Olemassa olevaa näytettä ei voitu käyttää.";
"qtKitErrorString2053" = "Ohjelma yritti käyttää ominaisuutta, jota ei tueta.";
"qtKitErrorString2125" = "Tiedoston poikkeama on liian suuri.";
"qtKitErrorString2149" = "Elokuvadataa ei ole riittävästi käytettävissä.";
"qtKitErrorString5000" = "Sinulla ei ole tarvittavia oikeuksia toimintoon.";
"qtKitErrorString8969" = "Elokuva sisältää virheellistä dataa.";

/* QTKitErrorDomain error strings */
"QTKitErrorDomain_QTErrorUnknown_Description"									= "Toimintoa ei voitu suorittaa loppuun.";
"QTKitErrorDomain_QTErrorUnknown_FailureReason"									= "Toimintoa ei voitu suorittaa loppuun, koska tapahtui tuntematon virhe. (%@)";
"QTKitErrorDomain_QTErrorInvalidInputsOrOutputs_Description"					= "Mediaa ei voida kaapata.";
"QTKitErrorDomain_QTErrorInvalidInputsOrOutputs_FailureReason"					= "Jotkin medialähteet eivät ole yhteensopivia mediakohteiden kanssa.";
"QTKitErrorDomain_QTErrorDeviceAlreadyUsedbyAnotherSession_Description"			= "Laitteesta ”%@” ei voitu kaapata mediaa, koska sitä käytetään jo muualla tässä ohjelmassa.";
"QTKitErrorDomain_QTErrorDeviceAlreadyUsedbyAnotherSession_RecoverySuggestion"	= "Pysäytä kaikki laitetta ”%@” käyttävät toiminnot tai odota, että toiminnot suoritetaan loppuun.";
"QTKitErrorDomain_QTErrorNoDataCaptured_Description"							= "Tallennus epäonnistui, koska dataa ei vastaanotettu.";
"QTKitErrorDomain_QTErrorNoDataCaptured_RecoverySuggestion"						= "Varmista, että medialähde on päällä ja toistaa.";
"QTKitErrorDomain_QTErrorSessionConfigurationChanged_Description"				= "Tallennus pysähtyi, koska medialähteiden ja -kohteiden määrittely muuttui.";
"QTKitErrorDomain_QTErrorSessionConfigurationChanged_RecoverySuggestion"		= "Yritä tallennusta uudelleen.";
"QTKitErrorDomain_QTErrorDiskFull_Description"									= "Kohteeseen ”%@” tallentaminen pysähtyi, koska ”%@” on lähes täynnä.";
"QTKitErrorDomain_QTErrorDiskFull_RecoverySuggestion"							= "Poista tiedostoja levyltä ”%@” tai tallenna toiselle levylle.";
"QTKitErrorDomain_QTErrorDeviceWasDisconnected_Description"						= "Tallentaminen pysähtyi, koska laite ”%@” laitettiin pois päältä tai irrotettiin.";
"QTKitErrorDomain_QTErrorDeviceWasDisconnected_RecoverySuggestion"				= "Voit ehkä jatkaa tallennusta liittämällä laitteen ”%@” uudelleen tai laittamalla sen päälle.";
"QTKitErrorDomain_QTErrorMediaChanged_Description"								= "Tallennus pysähtyi, koska lähdemedian muoto muuttui.";
"QTKitErrorDomain_QTErrorMediaChanged_FailureReason"							= "Erimuotoisia medioita ei voida tallentaa samaan tiedostoon.";
"QTKitErrorDomain_QTErrorMaximumDurationReached_Description"					= "Tallennus pysähtyi, koska tiedosto ei voi olla pidempi kuin %@.";
"QTKitErrorDomain_QTErrorMaximumDurationReached_FailureReason"					= "Enimmäiskesto on %@.";
"QTKitErrorDomain_QTErrorMaximumFileSizeReached_Description"					= "Tallennus pysähtyi, koska tiedosto ei voi olla suurempi kuin %@.";
"QTKitErrorDomain_QTErrorMaximumFileSizeReached_FailureReason"					= "Enimmäistiedostokoko on %@.";
"QTKitErrorDomain_QTErrorMediaDiscontinuity_Description"						= "Tallennus pysähtyi, koska syötemediassa oli katkos.";
"QTKitErrorDomain_QTErrorMediaDiscontinuity_RecoverySuggestion"					= "Sulje ohjelmia tai irrota laitteita, jotka käyttävät tallennukseen tarvittavia resursseja.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_Description"						= "Laitetta ”%@” ei voitu avata, koska sitä ei ole liitetty tai se ei ole päällä.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_RecoverySuggestion"					= "Liitä laite ”%@” tai laita se päälle ennen sen avaamista.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_UnknownDevice_Description"          = "Laitetta ei voitu avata, koska sitä ei ole liitetty tai se ei ole päällä.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_UnknownDevice_RecoverySuggestion"   = "Yritä käynnistää tai liittää laitteet ennen niiden avaamista.";
"QTKitErrorDomain_QTErrorDeviceInUseByAnotherApplication_Description"			= "Laitetta ”%@” ei voitu avata, koska toinen ohjelma käyttää sitä.";
"QTKitErrorDomain_QTErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Pysäytä kaikki laitetta ”%@” käyttävät toiminnot, odota, että toiminnot suoritetaan loppuun, tai lopeta laitetta käyttävä ohjelma.";
"QTKitErrorDomain_QTErrorDeviceExcludedByAnotherDevice_Description"				= "Laitetta ”%@” ei voitu avata, koska sen kanssa ristiriidassa oleva laite ”%@” on jo avoinna.";
"QTKitErrorDomain_QTErrorDeviceExcludedByAnotherDevice_RecoverySuggestion"		= "Pysäytä kaikki laitetta ”%@” käyttävät toiminnot.";
"QTKitErrorDomain_QTErrorMaximumNumberOfSamplesForFileFormatReached_Description"        = "Tallentaminen lopetettiin, koska tiedoston enimmäispituus saavutettiin.";
"QTKitErrorDomain_QTErrorMaximumNumberOfSamplesForFileFormatReached_RecoverySuggestion" = "Jatka tallentamista uuteen tiedostoon.";

"qtKitDataSizeInBytes" = "%@ tavua";
"qtKitDataSizeInKilobytes" = "%@ Kt";
"qtKitDataSizeInMegabytes" = "%@ Mt";
"qtKitDataSizeInGigabytes" = "%@ Gt";
"qtKitDataSizeInTerabytes" = "%@ Tt";
"qtKitDataSizeInPetabytes" = "%@ Pt";
"qtKitDataSizeInExabytes" = "%@ Et";
"qtKitInexactAndExactDataSize" = "%@ (%@)";	/* Data size in a certain unit followed by the exact size in bytes */

"qtKitBitDepthStringForBlackAndWhiteColors" = "Mustavalkoinen";
"qtKitBitDepthStringForFourColors" = "4";
"qtKitBitDepthStringForSixteenColors" = "16";
"qtKitBitDepthStringForTwoHundredFiftySixColors" = "256";
"qtKitBitDepthStringForThousandsColors" = "Tuhansia";
"qtKitBitDepthStringForMillionsColors" = "Miljoonia";
"qtKitBitDepthStringForMillionsPlusColors" = "Miljoonia+";
"qtKitBitDepthStringForUnknownColors" = "Tuntematon";
"qtKitBitDepthStringForColorsColors" = "Värejä";
"qtKitBitDepthStringForGrayColors" = "Harmaasävyjä";
